#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстДляПользователя = "Изменилось количество";
	
	ПересчитатьСуммуСтроки(ТекстДляПользователя, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстДляПользователя = "Изменилась цена";
	
	ПересчитатьСуммуСтроки(ТекстДляПользователя, ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ПересчитатьСуммуСтроки(ТекстСообщения, Строка)
	Строка.Сумма = Строка.Цена * Строка.Количество;
	Сообщение = Новый СообщениеПользователю();
    Сообщение.Текст = ТекстСообщения;
    Сообщение.Сообщить();
	
	
	Пользователь = ОписаниеСотрудника();
	Сообщение = Новый СообщениеПользователю();
    Сообщение.Текст = Пользователь.Имя;
    Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеСотрудника()
	
	Человек = Новый Структура;
	Человек.Вставить("Имя", "Антон");
	Человек.Вставить("СтажЛет", 15);
	Человек.Вставить("Штатный", Истина);
	Человек.Вставить("ДатаРождения", ТекущаяДата());
	
	Возврат Человек;
	
КонецФункции

#КонецОбласти